# 2D list comprehension
matrix = [[1,2],[3,4],[5,6],[7,8]]
# a=[]
# for row in range(2):
#     b = []
#     for col in matrix:
#         b.append(col[row])
#     a.append(b)
# print(a)

#transpose matrix e conversation
res = [[col[row] for col in matrix] for row in range(2)]
print(res)




#🧩 ভেতরের অংশ:
# [col[row] for col in matrix]
# এখানে matrix এর প্রতিটি সাবলিস্ট (col) নেওয়া হচ্ছে।

# তারপর col[row] নেওয়া হচ্ছে।

# মানে আগের মতোই প্রতিটি সাবলিস্ট থেকে row ইনডেক্সের ভ্যালু বের করা হচ্ছে।

# 👉 উদাহরণ:

# যদি row = 0 হয় → [1,3,5,7]

# যদি row = 1 হয় → [2,4,6,8]



# 🧩 বাইরের অংশ: 
# for row in range(2)
# এখানে row এর মান হবে 0 এবং 1।

# তাই ভেতরের লিস্ট comprehension দুইবার চলবে।

# প্রথমবার row = 0 → [1,3,5,7]

# দ্বিতীয়বার row = 1 → [2,4,6,8]